; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_19_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11 c12 c13 c14 c15 c16 c17 c18 - counter
	)
  (:init
		(= (value c0) 99)
	(= (value c1) 15)
	(= (value c2) 89)
	(= (value c3) 62)
	(= (value c4) 0)
	(= (value c5) 100)
	(= (value c6) 3)
	(= (value c7) 25)
	(= (value c8) 91)
	(= (value c9) 58)
	(= (value c10) 21)
	(= (value c11) 79)
	(= (value c12) 50)
	(= (value c13) 73)
	(= (value c14) 28)
	(= (value c15) 100)
	(= (value c16) 47)
	(= (value c17) 5)
	(= (value c18) 99)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)
	(= (rate_value c9) 0)
	(= (rate_value c10) 0)
	(= (rate_value c11) 0)
	(= (rate_value c12) 0)
	(= (rate_value c13) 0)
	(= (rate_value c14) 0)
	(= (rate_value c15) 0)
	(= (rate_value c16) 0)
	(= (rate_value c17) 0)
	(= (rate_value c18) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
	(<= (+ (value c8) 1) (value c9))
	(<= (+ (value c9) 1) (value c10))
	(<= (+ (value c10) 1) (value c11))
	(<= (+ (value c11) 1) (value c12))
	(<= (+ (value c12) 1) (value c13))
	(<= (+ (value c13) 1) (value c14))
	(<= (+ (value c14) 1) (value c15))
	(<= (+ (value c15) 1) (value c16))
	(<= (+ (value c16) 1) (value c17))
	(<= (+ (value c17) 1) (value c18))
		)
	)
)

; plan
1. (increase_rate c16)
   changed: (rate_value c16) from 0 to 1
   goals met: 8 of 18
2. (increase_rate c9)
   changed: (rate_value c9) from 0 to 1
   goals met: 8 of 18
3. (increase_rate c10)
   changed: (rate_value c10) from 0 to 1
   goals met: 8 of 18
4. (increase_rate c10)
   changed: (rate_value c10) from 1 to 2
   goals met: 8 of 18
5. (increase_rate c10)
   changed: (rate_value c10) from 2 to 3
   goals met: 8 of 18
6. (increase_rate c10)
   changed: (rate_value c10) from 3 to 4
   goals met: 8 of 18
7. (increase_rate c10)
   changed: (rate_value c10) from 4 to 5
   goals met: 8 of 18
8. (increase_rate c17)
   changed: (rate_value c17) from 0 to 1
   goals met: 8 of 18
9. (increase_rate c17)
   changed: (rate_value c17) from 1 to 2
   goals met: 8 of 18
10. (increase_rate c17)
   changed: (rate_value c17) from 2 to 3
   goals met: 8 of 18
11. (increase_rate c17)
   changed: (rate_value c17) from 3 to 4
   goals met: 8 of 18
12. (increase_rate c17)
   changed: (rate_value c17) from 4 to 5
   goals met: 8 of 18
13. (increase_rate c17)
   changed: (rate_value c17) from 5 to 6
   goals met: 8 of 18
14. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 8 of 18
15. (increase_rate c0)
   changed: (rate_value c0) from 0 to 1
   goals met: 8 of 18
16. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 8 of 18
17. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 8 of 18
18. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 8 of 18
19. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 8 of 18
20. (increase_rate c1)
   changed: (rate_value c1) from 5 to 6
   goals met: 8 of 18
21. (increase_rate c1)
   changed: (rate_value c1) from 6 to 7
   goals met: 8 of 18
22. (increase_rate c0)
   changed: (rate_value c0) from 1 to 2
   goals met: 8 of 18
23. (increase_rate c0)
   changed: (rate_value c0) from 2 to 3
   goals met: 8 of 18
24. (increase_rate c0)
   changed: (rate_value c0) from 3 to 4
   goals met: 8 of 18
25. (increase_rate c0)
   changed: (rate_value c0) from 4 to 5
   goals met: 8 of 18
26. (increase_rate c1)
   changed: (rate_value c1) from 7 to 8
   goals met: 8 of 18
27. (increase_rate c17)
   changed: (rate_value c17) from 6 to 7
   goals met: 8 of 18
28. (increase_rate c15)
   changed: (rate_value c15) from 0 to 1
   goals met: 8 of 18
29. (decrement_rate c16)
   changed: (rate_value c16) from 1 to 0
   goals met: 8 of 18
30. (increase_rate c15)
   changed: (rate_value c15) from 1 to 2
   goals met: 8 of 18
31. (increase_rate c15)
   changed: (rate_value c15) from 2 to 3
   goals met: 8 of 18
32. (increase_rate c15)
   changed: (rate_value c15) from 3 to 4
   goals met: 8 of 18
33. (increase_rate c15)
   changed: (rate_value c15) from 4 to 5
   goals met: 8 of 18
34. (increase_rate c16)
   changed: (rate_value c16) from 0 to 1
   goals met: 8 of 18
35. (increase_rate c15)
   changed: (rate_value c15) from 5 to 6
   goals met: 8 of 18
36. (decrement_rate c16)
   changed: (rate_value c16) from 1 to 0
   goals met: 8 of 18
37. (increase_rate c17)
   changed: (rate_value c17) from 7 to 8
   goals met: 8 of 18
38. (increase_rate c17)
   changed: (rate_value c17) from 8 to 9
   goals met: 8 of 18
39. (increment c17)
   changed: (value c17) from 5 to 14
   goals met: 8 of 18
40. (increment c17)
   changed: (value c17) from 14 to 23
   goals met: 8 of 18
41. (increment c17)
   changed: (value c17) from 23 to 32
   goals met: 8 of 18
42. (increase_rate c17)
   changed: (rate_value c17) from 9 to 10
   goals met: 8 of 18
43. (increment c17)
   changed: (value c17) from 32 to 42
   goals met: 8 of 18
44. (increment c17)
   changed: (value c17) from 42 to 52
   goals met: 9 of 18
45. (increase_rate c16)
   changed: (rate_value c16) from 0 to 1
   goals met: 9 of 18
46. (increase_rate c15)
   changed: (rate_value c15) from 6 to 7
   goals met: 9 of 18
47. (decrement c15)
   changed: (value c15) from 100 to 93
   goals met: 9 of 18
48. (increase_rate c16)
   changed: (rate_value c16) from 1 to 2
   goals met: 9 of 18
49. (increase_rate c16)
   changed: (rate_value c16) from 2 to 3
   goals met: 9 of 18
50. (increase_rate c15)
   changed: (rate_value c15) from 7 to 8
   goals met: 9 of 18
51. (decrement c15)
   changed: (value c15) from 93 to 85
   goals met: 9 of 18
52. (decrement c15)
   changed: (value c15) from 85 to 77
   goals met: 9 of 18
53. (decrement c15)
   changed: (value c15) from 77 to 69
   goals met: 9 of 18
54. (increase_rate c15)
   changed: (rate_value c15) from 8 to 9
   goals met: 9 of 18
55. (increase_rate c15)
   changed: (rate_value c15) from 9 to 10
   goals met: 9 of 18
56. (decrement c15)
   changed: (value c15) from 69 to 59
   goals met: 9 of 18
57. (increment c16)
   changed: (value c16) from 47 to 50
   goals met: 9 of 18
58. (decrement c15)
   changed: (value c15) from 59 to 49
   goals met: 10 of 18
59. (increase_rate c10)
   changed: (rate_value c10) from 5 to 6
   goals met: 10 of 18
60. (increase_rate c10)
   changed: (rate_value c10) from 6 to 7
   goals met: 10 of 18
61. (increment c10)
   changed: (value c10) from 21 to 28
   goals met: 10 of 18
62. (increase_rate c9)
   changed: (rate_value c9) from 1 to 2
   goals met: 10 of 18
63. (increase_rate c9)
   changed: (rate_value c9) from 2 to 3
   goals met: 10 of 18
64. (increase_rate c9)
   changed: (rate_value c9) from 3 to 4
   goals met: 10 of 18
65. (increase_rate c9)
   changed: (rate_value c9) from 4 to 5
   goals met: 10 of 18
66. (increment c10)
   changed: (value c10) from 28 to 35
   goals met: 10 of 18
67. (increment c10)
   changed: (value c10) from 35 to 42
   goals met: 10 of 18
68. (increment c10)
   changed: (value c10) from 42 to 49
   goals met: 10 of 18
69. (increment c10)
   changed: (value c10) from 49 to 56
   goals met: 10 of 18
70. (increment c10)
   changed: (value c10) from 56 to 63
   goals met: 11 of 18
71. (increase_rate c9)
   changed: (rate_value c9) from 5 to 6
   goals met: 11 of 18
72. (increase_rate c9)
   changed: (rate_value c9) from 6 to 7
   goals met: 11 of 18
73. (increment c9)
   changed: (value c9) from 58 to 65
   goals met: 10 of 18
74. (increment c10)
   changed: (value c10) from 63 to 70
   goals met: 11 of 18
75. (increase_rate c8)
   changed: (rate_value c8) from 0 to 1
   goals met: 11 of 18
76. (increase_rate c8)
   changed: (rate_value c8) from 1 to 2
   goals met: 11 of 18
77. (increment c9)
   changed: (value c9) from 65 to 72
   goals met: 10 of 18
78. (increment c10)
   changed: (value c10) from 70 to 77
   goals met: 11 of 18
79. (increment c9)
   changed: (value c9) from 72 to 79
   goals met: 10 of 18
80. (increment c9)
   changed: (value c9) from 79 to 86
   goals met: 10 of 18
81. (increment c10)
   changed: (value c10) from 77 to 84
   goals met: 9 of 18
82. (increment c9)
   changed: (value c9) from 86 to 93
   goals met: 10 of 18
83. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 10 of 18
84. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 10 of 18
85. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 10 of 18
86. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 10 of 18
87. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 10 of 18
88. (increase_rate c4)
   changed: (rate_value c4) from 4 to 5
   goals met: 10 of 18
89. (decrement_rate c3)
   changed: (rate_value c3) from 1 to 0
   goals met: 10 of 18
90. (increase_rate c4)
   changed: (rate_value c4) from 5 to 6
   goals met: 10 of 18
91. (increase_rate c4)
   changed: (rate_value c4) from 6 to 7
   goals met: 10 of 18
92. (increase_rate c4)
   changed: (rate_value c4) from 7 to 8
   goals met: 10 of 18
93. (increment c4)
   changed: (value c4) from 0 to 8
   goals met: 10 of 18
94. (increment c4)
   changed: (value c4) from 8 to 16
   goals met: 10 of 18
95. (increment c4)
   changed: (value c4) from 16 to 24
   goals met: 10 of 18
96. (increment c4)
   changed: (value c4) from 24 to 32
   goals met: 10 of 18
97. (increment c4)
   changed: (value c4) from 32 to 40
   goals met: 10 of 18
98. (increment c4)
   changed: (value c4) from 40 to 48
   goals met: 10 of 18
99. (increment c4)
   changed: (value c4) from 48 to 56
   goals met: 10 of 18
100. (increment c4)
   changed: (value c4) from 56 to 64
   goals met: 11 of 18
101. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 11 of 18
102. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 11 of 18
103. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 11 of 18
104. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 11 of 18
105. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 11 of 18
106. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 11 of 18
107. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 11 of 18
108. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 11 of 18
109. (increment c3)
   changed: (value c3) from 62 to 67
   goals met: 10 of 18
110. (increment c3)
   changed: (value c3) from 67 to 72
   goals met: 10 of 18
111. (increment c4)
   changed: (value c4) from 64 to 72
   goals met: 10 of 18
112. (increment c4)
   changed: (value c4) from 72 to 80
   goals met: 11 of 18
113. (increment c3)
   changed: (value c3) from 72 to 77
   goals met: 11 of 18
114. (increment c3)
   changed: (value c3) from 77 to 82
   goals met: 10 of 18
115. (increment c4)
   changed: (value c4) from 80 to 88
   goals met: 11 of 18
116. (increment c3)
   changed: (value c3) from 82 to 87
   goals met: 11 of 18
117. (decrement c2)
   changed: (value c2) from 89 to 86
   goals met: 12 of 18
118. (increase_rate c1)
   changed: (rate_value c1) from 8 to 9
   goals met: 12 of 18
119. (increment c1)
   changed: (value c1) from 15 to 24
   goals met: 12 of 18
120. (increment c1)
   changed: (value c1) from 24 to 33
   goals met: 12 of 18
121. (increase_rate c1)
   changed: (rate_value c1) from 9 to 10
   goals met: 12 of 18
122. (increment c1)
   changed: (value c1) from 33 to 43
   goals met: 12 of 18
123. (increment c1)
   changed: (value c1) from 43 to 53
   goals met: 12 of 18
124. (increment c1)
   changed: (value c1) from 53 to 63
   goals met: 12 of 18
125. (increment c1)
   changed: (value c1) from 63 to 73
   goals met: 12 of 18
126. (increment c1)
   changed: (value c1) from 73 to 83
   goals met: 12 of 18
127. (decrement c0)
   changed: (value c0) from 99 to 94
   goals met: 12 of 18
128. (decrement c0)
   changed: (value c0) from 94 to 89
   goals met: 12 of 18
129. (decrement c0)
   changed: (value c0) from 89 to 84
   goals met: 12 of 18
130. (decrement c0)
   changed: (value c0) from 84 to 79
   goals met: 13 of 18
131. (increase_rate c14)
   changed: (rate_value c14) from 0 to 1
   goals met: 13 of 18
132. (increase_rate c14)
   changed: (rate_value c14) from 1 to 2
   goals met: 13 of 18
133. (increase_rate c14)
   changed: (rate_value c14) from 2 to 3
   goals met: 13 of 18
134. (increase_rate c14)
   changed: (rate_value c14) from 3 to 4
   goals met: 13 of 18
135. (increase_rate c14)
   changed: (rate_value c14) from 4 to 5
   goals met: 13 of 18
136. (increase_rate c14)
   changed: (rate_value c14) from 5 to 6
   goals met: 13 of 18
137. (increase_rate c14)
   changed: (rate_value c14) from 6 to 7
   goals met: 13 of 18
138. (increase_rate c14)
   changed: (rate_value c14) from 7 to 8
   goals met: 13 of 18
139. (increment c14)
   changed: (value c14) from 28 to 36
   goals met: 13 of 18
140. (increment c14)
   changed: (value c14) from 36 to 44
   goals met: 13 of 18
141. (increase_rate c13)
   changed: (rate_value c13) from 0 to 1
   goals met: 13 of 18
142. (increase_rate c13)
   changed: (rate_value c13) from 1 to 2
   goals met: 13 of 18
143. (increment c14)
   changed: (value c14) from 44 to 52
   goals met: 12 of 18
144. (increase_rate c14)
   changed: (rate_value c14) from 8 to 9
   goals met: 12 of 18
145. (increase_rate c14)
   changed: (rate_value c14) from 9 to 10
   goals met: 12 of 18
146. (increment c14)
   changed: (value c14) from 52 to 62
   goals met: 12 of 18
147. (increase_rate c12)
   changed: (rate_value c12) from 0 to 1
   goals met: 12 of 18
148. (increase_rate c12)
   changed: (rate_value c12) from 1 to 2
   goals met: 12 of 18
149. (increase_rate c12)
   changed: (rate_value c12) from 2 to 3
   goals met: 12 of 18
150. (increase_rate c12)
   changed: (rate_value c12) from 3 to 4
   goals met: 12 of 18
151. (increase_rate c12)
   changed: (rate_value c12) from 4 to 5
   goals met: 12 of 18
152. (increase_rate c12)
   changed: (rate_value c12) from 5 to 6
   goals met: 12 of 18
153. (increment c12)
   changed: (value c12) from 50 to 56
   goals met: 12 of 18
154. (increment c12)
   changed: (value c12) from 56 to 62
   goals met: 12 of 18
155. (increment c12)
   changed: (value c12) from 62 to 68
   goals met: 12 of 18
156. (increment c12)
   changed: (value c12) from 68 to 74
   goals met: 11 of 18
157. (increment c12)
   changed: (value c12) from 74 to 80
   goals met: 12 of 18
158. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 12 of 18
159. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 12 of 18
160. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 12 of 18
161. (increase_rate c6)
   changed: (rate_value c6) from 3 to 4
   goals met: 12 of 18
162. (increase_rate c6)
   changed: (rate_value c6) from 4 to 5
   goals met: 12 of 18
163. (increase_rate c6)
   changed: (rate_value c6) from 5 to 6
   goals met: 12 of 18
164. (increase_rate c6)
   changed: (rate_value c6) from 6 to 7
   goals met: 12 of 18
165. (increase_rate c6)
   changed: (rate_value c6) from 7 to 8
   goals met: 12 of 18
166. (increase_rate c6)
   changed: (rate_value c6) from 8 to 9
   goals met: 12 of 18
167. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 12 of 18
168. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 12 of 18
169. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 12 of 18
170. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 12 of 18
171. (increase_rate c5)
   changed: (rate_value c5) from 4 to 5
   goals met: 12 of 18
172. (increment c6)
   changed: (value c6) from 3 to 12
   goals met: 12 of 18
173. (increase_rate c6)
   changed: (rate_value c6) from 9 to 10
   goals met: 12 of 18
174. (increment c6)
   changed: (value c6) from 12 to 22
   goals met: 12 of 18
175. (increment c6)
   changed: (value c6) from 22 to 32
   goals met: 11 of 18
176. (increase_rate c5)
   changed: (rate_value c5) from 5 to 6
   goals met: 11 of 18
177. (decrement c6)
   changed: (value c6) from 32 to 22
   goals met: 12 of 18
178. (decrement c5)
   changed: (value c5) from 100 to 94
   goals met: 12 of 18
179. (increment c6)
   changed: (value c6) from 22 to 32
   goals met: 11 of 18
180. (decrement c5)
   changed: (value c5) from 94 to 88
   goals met: 10 of 18
181. (decrement c5)
   changed: (value c5) from 88 to 82
   goals met: 10 of 18
182. (increase_rate c5)
   changed: (rate_value c5) from 6 to 7
   goals met: 10 of 18
183. (increment c6)
   changed: (value c6) from 32 to 42
   goals met: 10 of 18
184. (decrement c5)
   changed: (value c5) from 82 to 75
   goals met: 10 of 18
185. (increase_rate c5)
   changed: (rate_value c5) from 7 to 8
   goals met: 10 of 18
186. (increase_rate c5)
   changed: (rate_value c5) from 8 to 9
   goals met: 10 of 18
187. (increase_rate c5)
   changed: (rate_value c5) from 9 to 10
   goals met: 10 of 18
188. (decrement c6)
   changed: (value c6) from 42 to 32
   goals met: 10 of 18
189. (decrement c5)
   changed: (value c5) from 75 to 65
   goals met: 10 of 18
190. (decrement c4)
   changed: (value c4) from 88 to 80
   goals met: 9 of 18
191. (increment c14)
   changed: (value c14) from 62 to 72
   goals met: 9 of 18
192. (increment c14)
   changed: (value c14) from 72 to 82
   goals met: 10 of 18
193. (increment c13)
   changed: (value c13) from 73 to 75
   goals met: 10 of 18
194. (increment c13)
   changed: (value c13) from 75 to 77
   goals met: 10 of 18
195. (increment c13)
   changed: (value c13) from 77 to 79
   goals met: 10 of 18
196. (increment c13)
   changed: (value c13) from 79 to 81
   goals met: 11 of 18
197. (decrement c10)
   changed: (value c10) from 84 to 77
   goals met: 12 of 18
198. (increase_rate c10)
   changed: (rate_value c10) from 7 to 8
   goals met: 12 of 18
199. (increase_rate c10)
   changed: (rate_value c10) from 8 to 9
   goals met: 12 of 18
200. (increase_rate c10)
   changed: (rate_value c10) from 9 to 10
   goals met: 12 of 18
201. (increment c10)
   changed: (value c10) from 77 to 87
   goals met: 11 of 18
202. (decrement c9)
   changed: (value c9) from 93 to 86
   goals met: 11 of 18
203. (decrement c8)
   changed: (value c8) from 91 to 89
   goals met: 11 of 18
204. (decrement c8)
   changed: (value c8) from 89 to 87
   goals met: 11 of 18
205. (decrement c8)
   changed: (value c8) from 87 to 85
   goals met: 12 of 18
206. (increment c4)
   changed: (value c4) from 80 to 88
   goals met: 13 of 18
207. (increase_rate c4)
   changed: (rate_value c4) from 8 to 9
   goals met: 13 of 18
208. (increase_rate c4)
   changed: (rate_value c4) from 9 to 10
   goals met: 13 of 18
209. (decrement c6)
   changed: (value c6) from 32 to 22
   goals met: 14 of 18
210. (decrement c5)
   changed: (value c5) from 65 to 55
   goals met: 14 of 18
211. (increment c6)
   changed: (value c6) from 22 to 32
   goals met: 13 of 18
212. (decrement c5)
   changed: (value c5) from 55 to 45
   goals met: 13 of 18
213. (decrement c5)
   changed: (value c5) from 45 to 35
   goals met: 13 of 18
214. (decrement_rate c5)
   changed: (rate_value c5) from 10 to 9
   goals met: 13 of 18
215. (increment c5)
   changed: (value c5) from 35 to 44
   goals met: 13 of 18
216. (increment c5)
   changed: (value c5) from 44 to 53
   goals met: 13 of 18
217. (increment c5)
   changed: (value c5) from 53 to 62
   goals met: 13 of 18
218. (increment c5)
   changed: (value c5) from 62 to 71
   goals met: 13 of 18
219. (increase_rate c5)
   changed: (rate_value c5) from 9 to 10
   goals met: 13 of 18
220. (increment c6)
   changed: (value c6) from 32 to 42
   goals met: 13 of 18
221. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 13 of 18
222. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 13 of 18
223. (increase_rate c7)
   changed: (rate_value c7) from 2 to 3
   goals met: 13 of 18
224. (increase_rate c7)
   changed: (rate_value c7) from 3 to 4
   goals met: 13 of 18
225. (increment c7)
   changed: (value c7) from 25 to 29
   goals met: 13 of 18
226. (increment c7)
   changed: (value c7) from 29 to 33
   goals met: 13 of 18
227. (increment c7)
   changed: (value c7) from 33 to 37
   goals met: 13 of 18
228. (increment c7)
   changed: (value c7) from 37 to 41
   goals met: 13 of 18
229. (increment c7)
   changed: (value c7) from 41 to 45
   goals met: 14 of 18
230. (increment c6)
   changed: (value c6) from 42 to 52
   goals met: 13 of 18
231. (increment c7)
   changed: (value c7) from 45 to 49
   goals met: 13 of 18
232. (increment c7)
   changed: (value c7) from 49 to 53
   goals met: 14 of 18
233. (increment c6)
   changed: (value c6) from 52 to 62
   goals met: 13 of 18
234. (increment c7)
   changed: (value c7) from 53 to 57
   goals met: 13 of 18
235. (increment c7)
   changed: (value c7) from 57 to 61
   goals met: 13 of 18
236. (increment c7)
   changed: (value c7) from 61 to 65
   goals met: 14 of 18
237. (increment c6)
   changed: (value c6) from 62 to 72
   goals met: 14 of 18
238. (increment c7)
   changed: (value c7) from 65 to 69
   goals met: 14 of 18
239. (increment c7)
   changed: (value c7) from 69 to 73
   goals met: 15 of 18
240. (increment c15)
   changed: (value c15) from 49 to 59
   goals met: 14 of 18
241. (increment c15)
   changed: (value c15) from 59 to 69
   goals met: 14 of 18
242. (increase_rate c16)
   changed: (rate_value c16) from 3 to 4
   goals met: 14 of 18
243. (increase_rate c16)
   changed: (rate_value c16) from 4 to 5
   goals met: 14 of 18
244. (increment c16)
   changed: (value c16) from 50 to 55
   goals met: 13 of 18
245. (increment c17)
   changed: (value c17) from 52 to 62
   goals met: 14 of 18
246. (increment c16)
   changed: (value c16) from 55 to 60
   goals met: 14 of 18
247. (increment c16)
   changed: (value c16) from 60 to 65
   goals met: 13 of 18
248. (increment c17)
   changed: (value c17) from 62 to 72
   goals met: 14 of 18
249. (increment c16)
   changed: (value c16) from 65 to 70
   goals met: 15 of 18
250. (increment c15)
   changed: (value c15) from 69 to 79
   goals met: 14 of 18
251. (increment c16)
   changed: (value c16) from 70 to 75
   goals met: 13 of 18
252. (increment c17)
   changed: (value c17) from 72 to 82
   goals met: 14 of 18
253. (increment c16)
   changed: (value c16) from 75 to 80
   goals met: 15 of 18
254. (increment c15)
   changed: (value c15) from 79 to 89
   goals met: 15 of 18
255. (increment c16)
   changed: (value c16) from 80 to 85
   goals met: 14 of 18
256. (increment c17)
   changed: (value c17) from 82 to 92
   goals met: 15 of 18
257. (increment c16)
   changed: (value c16) from 85 to 90
   goals met: 16 of 18
258. (increment c5)
   changed: (value c5) from 71 to 81
   goals met: 15 of 18
259. (increment c6)
   changed: (value c6) from 72 to 82
   goals met: 15 of 18
260. (increment c7)
   changed: (value c7) from 73 to 77
   goals met: 15 of 18
261. (increment c7)
   changed: (value c7) from 77 to 81
   goals met: 15 of 18
262. (increment c7)
   changed: (value c7) from 81 to 85
   goals met: 15 of 18
263. (increment c8)
   changed: (value c8) from 85 to 87
   goals met: 15 of 18
264. (increment c9)
   changed: (value c9) from 86 to 93
   goals met: 15 of 18
265. (decrement c10)
   changed: (value c10) from 87 to 77
   goals met: 16 of 18
266. (decrement c4)
   changed: (value c4) from 88 to 78
   goals met: 16 of 18
267. (decrement c3)
   changed: (value c3) from 87 to 82
   goals met: 15 of 18
268. (decrement c3)
   changed: (value c3) from 82 to 77
   goals met: 16 of 18
269. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 16 of 18
270. (increase_rate c2)
   changed: (rate_value c2) from 4 to 5
   goals met: 16 of 18
271. (decrement c2)
   changed: (value c2) from 86 to 81
   goals met: 15 of 18
272. (decrement c2)
   changed: (value c2) from 81 to 76
   goals met: 16 of 18
273. (decrement c1)
   changed: (value c1) from 83 to 73
   goals met: 16 of 18
274. (decrement c0)
   changed: (value c0) from 79 to 74
   goals met: 16 of 18
275. (decrement c0)
   changed: (value c0) from 74 to 69
   goals met: 17 of 18
276. (increment c10)
   changed: (value c10) from 77 to 87
   goals met: 16 of 18
277. (decrement c9)
   changed: (value c9) from 93 to 86
   goals met: 16 of 18
278. (decrement c8)
   changed: (value c8) from 87 to 85
   goals met: 16 of 18
279. (decrement c7)
   changed: (value c7) from 85 to 81
   goals met: 16 of 18
280. (decrement c6)
   changed: (value c6) from 82 to 72
   goals met: 16 of 18
281. (decrement c5)
   changed: (value c5) from 81 to 71
   goals met: 16 of 18
282. (decrement c4)
   changed: (value c4) from 78 to 68
   goals met: 16 of 18
283. (decrement c3)
   changed: (value c3) from 77 to 72
   goals met: 15 of 18
284. (decrement c3)
   changed: (value c3) from 72 to 67
   goals met: 16 of 18
285. (decrement c2)
   changed: (value c2) from 76 to 71
   goals met: 15 of 18
286. (decrement c2)
   changed: (value c2) from 71 to 66
   goals met: 16 of 18
287. (decrement c1)
   changed: (value c1) from 73 to 63
   goals met: 16 of 18
288. (decrement c0)
   changed: (value c0) from 69 to 64
   goals met: 16 of 18
289. (decrement c0)
   changed: (value c0) from 64 to 59
   goals met: 17 of 18
290. (decrement c10)
   changed: (value c10) from 87 to 77
   goals met: 17 of 18
291. (decrement c9)
   changed: (value c9) from 86 to 79
   goals met: 16 of 18
292. (decrement c9)
   changed: (value c9) from 79 to 72
   goals met: 17 of 18
293. (increase_rate c8)
   changed: (rate_value c8) from 2 to 3
   goals met: 17 of 18
294. (increase_rate c8)
   changed: (rate_value c8) from 3 to 4
   goals met: 17 of 18
295. (increase_rate c8)
   changed: (rate_value c8) from 4 to 5
   goals met: 17 of 18
296. (decrement c8)
   changed: (value c8) from 85 to 80
   goals met: 16 of 18
297. (decrement c8)
   changed: (value c8) from 80 to 75
   goals met: 16 of 18
298. (decrement c8)
   changed: (value c8) from 75 to 70
   goals met: 17 of 18
299. (decrement c7)
   changed: (value c7) from 81 to 77
   goals met: 17 of 18
300. (decrement c7)
   changed: (value c7) from 77 to 73
   goals met: 17 of 18
301. (decrement c7)
   changed: (value c7) from 73 to 69
   goals met: 17 of 18
302. (decrement c6)
   changed: (value c6) from 72 to 62
   goals met: 17 of 18
303. (decrement c5)
   changed: (value c5) from 71 to 61
   goals met: 17 of 18
304. (decrement c4)
   changed: (value c4) from 68 to 58
   goals met: 17 of 18
305. (decrement c3)
   changed: (value c3) from 67 to 62
   goals met: 16 of 18
306. (decrement c3)
   changed: (value c3) from 62 to 57
   goals met: 17 of 18
307. (decrement c2)
   changed: (value c2) from 66 to 61
   goals met: 16 of 18
308. (decrement c2)
   changed: (value c2) from 61 to 56
   goals met: 17 of 18
309. (decrement c1)
   changed: (value c1) from 63 to 53
   goals met: 17 of 18
310. (decrement c0)
   changed: (value c0) from 59 to 54
   goals met: 17 of 18
311. (decrement c0)
   changed: (value c0) from 54 to 49
   goals met: 18 of 18
